floripasat/ttc/firmware/fsat_beacon_msp430/drivers/radio/rf4463/rf4463_registers.h
#define RF4463_FRR_MODE_DISABLED                            0
#define RF4463_FRR_MODE_GLOBAL_STATUS                       1
#define RF4463_FRR_MODE_GLOBAL_INTERRUPT_PENDING            2
#define RF4463_FRR_MODE_PACKET_HANDLER_STATUS               3
#define RF4463_FRR_MODE_PACKET_HANDLER_INTERRUPT_PENDING    4
#define RF4463_FRR_MODE_MODEM_STATUS                        5
#define RF4463_FRR_MODE_MODEM_INTERRUPT_PENDING             6
#define RF4463_FRR_MODE_CHIP_STATUS                         7
#define RF4463_FRR_MODE_CHIP_INTERRUPT_PENDING              8
#define RF4463_FRR_MODE_CURRENT_STATE                       9
#define RF4463_FRR_MODE_LATCHED_RSSI                        10

//###################################################################
//-- PREAMBLE CONFIGURATION -----------------------------------------
//###################################################################

#define RF4463_PREAMBLE_STANDARD_PREAM                      0x00
#define RF4463_PREAMBLE_DSA_ONLY                            0x80
#define RF4463_PREAMBLE_FIRST_1                             0x20
#define RF4463_PREAMBLE_FIRST_0                             0x00
#define RF4463_PREAMBLE_LENGTH_NIBBLES                      0x00
#define RF4463_PREAMBLE_LENGTH_BYTES                        0x10
#define RF4463_PREAMBLE_MAN_CONST                           0x08
#define RF4463_PREAMBLE_MAN_ENABLE                          0x02
#define RF4463_PREAMBLE_NON_STANDARD                        0x00
#define RF4463_PREAMBLE_STANDARD_1010                       0x01
#define RF4463_PREAMBLE_STANDARD_0101                       0x02

//###################################################################
//-- SYNCH. CONFIGURATION -------------------------------------------
//###################################################################

#define RF4463_SYNC_CONFIG_SKIP_TX                          0x80
#define RF4463_SYNC_CONFIG_RX_ERRORS_MASK                   0x70
#define RF4463_SYNC_CONFIG_4FSK                             0x08
#define RF4463_SYNC_CONFIG_MANCH                            0x04
#define RF4463_SYNC_CONFIG_LENGTH_MASK                      0x03

//###################################################################
//-- PACKET CRC CONFIGURATION ---------------------------------------
//###################################################################

#define RF4463_CRC_SEED_ALL_0S                              0x00
#define RF4463_CRC_SEED_ALL_1S                              0x80
#define RF4463_CRC_MASK                                     0x0F
#define RF4463_CRC_NONE                                     0x00
#define RF4463_CRC_ITU_T                                    0x01
#define RF4463_CRC_IEC_16                                   0x02
#define RF4463_CRC_BIACHEVA                                 0x03
#define RF4463_CRC_16_IBM                                   0x04
#define RF4463_CRC_CCITT                                    0x05
#define RF4463_CRC_KOOPMAN                                  0x06
#define RF4463_CRC_IEEE_802_3                               0x07
#define RF4463_CRC_CASTAGNOLI                               0x08

//###################################################################
//-- PACKET CONFIG1 -------------------------------------------------
//###################################################################

#define RF4463_PH_FIELD_SPLIT                               0x80
#define RF4463_PH_RX_DISABLE                                0x40
#define RF4463_4FSK_EN                                      0x20
#define RF4463_RX_MULTI_PKT                                 0x10
#define RF4463_MANCH_POL                                    0x08
#define RF4463_CRC_INVERT                                   0x04
#define RF4463_CRC_ENDIAN                                   0x02
#define RF4463_BIT_ORDER                                    0x01

//###################################################################
//-- PACKET LENGTH --------------------------------------------------
//###################################################################

#define RF4463_INFINITE_LEN                                 0x40
#define RF4463_ENDIAN_LITTLE                                0x00
#define RF4463_ENDIAN_BIG                                   0x20
#define RF4463_SIZE_ENUM_0                                  0x00
#define RF4463_SIZE_ENUM_1                                  0x01
#define RF4463_IN_FIFO                                      0x08
#define RF4463_DST_FIELD_ENUM_0                             0x00
#define RF4463_DST_FIELD_ENUM_1                             0x01
#define RF4463_DST_FIELD_ENUM_2                             0x02
#define RF4463_DST_FIELD_ENUM_3                             0x03
#define RF4463_DST_FIELD_ENUM_4                             0x04
#define RF4463_DST_FIELD_ENUM_5                             0x05
#define RF4463_DST_FIELD_ENUM_6                             0x06
#define RF4463_DST_FIELD_ENUM_7                             0x07

//###################################################################
//-- PACKET LENGTH FIELD SOURCE -------------------------------------
//###################################################################

#define RF4463_SRC_FIELD_ENUM_0                             0x00
#define RF4463_SRC_FIELD_ENUM_1                             0x01
#define RF4463_SRC_FIELD_ENUM_2                             0x02
#define RF4463_SRC_FIELD_ENUM_3                             0x03
#define RF4463_SRC_FIELD_ENUM_4                             0x04
#define RF4463_SRC_FIELD_ENUM_5                             0x05

//###################################################################
//-- PACKET FIELDS CONFIGURATION ------------------------------------
//###################################################################

#define RF4463_FIELD_CONFIG_4FSK                            0x10
#define RF4463_FIELD_CONFIG_PN_START                        0x04
#define RF4463_FIELD_CONFIG_WHITEN                          0x02
#define RF4463_FIELD_CONFIG_MANCH                           0x01

//###################################################################
//-- PACKET RX FIELDS CRC CONFIGURATION -----------------------------
//###################################################################

#define RF4463_FIELD_CONFIG_CRC_START                       0x80
#define RF4463_FIELD_CONFIG_ALT_CRC_START                   0x40
#define RF4463_FIELD_CONFIG_SEND_CRC                        0x20
#define RF4463_FIELD_CONFIG_SEND_ALT_CRC                    0x10
#define RF4463_FIELD_CONFIG_CHECK_CRC                       0x08
#define RF4463_FIELD_CONFIG_CHECK_ALT_CRC                   0x04
#define RF4463_FIELD_CONFIG_CRC_ENABLE                      0x02
#define RF4463_FIELD_CONFIG_ALT_CRC_ENABLE                  0x01

//###################################################################
//-- PROPERTY MODEM MOD TYPE ----------------------------------------
//###################################################################

#define RF4463_TX_DIRECT_MODE_TYPE_SYNCHRONOUS              0x00
#define RF4463_TX_DIRECT_MODE_TYPE_ASYNCHRONOUS             0x80
#define RF4463_TX_DIRECT_MODE_GPIO0                         0x00
#define RF4463_TX_DIRECT_MODE_GPIO1                         0x20
#define RF4463_TX_DIRECT_MODE_GPIO2                         0x40
#define RF4463_TX_DIRECT_MODE_GPIO3                         0x60
#define RF4463_MOD_SOURCE_PACKET_HANDLER                    0x00
#define RF4463_MOD_SOURCE_DIRECT_MODE                       0x08
#define RF4463_MOD_SOURCE_RANDOM_GENERATOR                  0x10
#define RF4463_MOD_TYPE_CW                                  0x00
#define RF4463_MOD_TYPE_OOK                                 0x01
#define RF4463_MOD_TYPE_2FSK                                0x02
#define RF4463_MOD_TYPE_2GFSK                               0x03
#define RF4463_MOD_TYPE_4FSK                                0x04
#define RF4463_MOD_TYPE_4GFSK                               0x05

//###################################################################
//-- PROPERTY PA MODE -----------------------------------------------
//###################################################################

#define RF4463_PA_MODE_1_GROUP                              0x04
#define RF4463_PA_MODE_2_GROUPS                             0x08
#define RF4463_PA_MODE_CLASS_E                              0x00
#define RF4463_PA_MODE_SWITCH_CURRENT                       0x01

#endif // RF4463_REGISTERS_H_

//! \} End of rf4463 group
